# IP -> x.x.x.x ->  0 <= x <= 255
# Mask -> 11111...1110000...0
print(f'{192:b} {168:b} {32:b} {160:b}')
# 11000000 10101000 00100000 10100000
print(f'{255:b} {255:b} {255:b} {248:b}')
# 11111111 11111111 11111111 11110000
#IP & Mask = Address Network


# По заданным IP-адресу узла сети и маске определите адрес сети:
# IP-адрес: 10.8.248.131 Маска: 255.255.224.0
# При записи ответа выберите из приведенных в таблице чисел 4 фрагмента четыре элемента IP-адреса и запишите в нужном порядке соответствующие им буквы без точек.
# A
# B
# C
# D
# E
# F
# G
# H
# 8
# 131
# 255
# 224
# 0
# 10
# 248
# 92
print(10 & 255, 8 & 255, 248 & 224, 131 & 0) # FADE

print()
print('Демоверсия 2024')
print()

from ipaddress import *
# ip = ip_address('192.168.32.160')
# print(ip, f'{int(ip):b}')

network = ip_network('192.168.32.160/255.255.255.240')
# network = ip_network('10.8.248.131/255.255.224.0', False)
for ip in network:
    print(f'{int(ip):b}'.count('1'))

# print(network)
# 11111111111111111111111110000 -> 2^4 => 16